<script setup lang="ts">
import TheSection from '~/components/core/the-section';
import Competition from '~/components/elements/competition';
import Media from '~/components/elements/media';
import Presentation from '~/components/elements/presentation';
import { useMediasStore } from '~/stores/medias';

const mediasStore = useMediasStore();
</script>

<template>
	<the-section :title="['Конкурс', 'на создание']" class="section-competition">
		<div class="section-competition-content">
			<div class="section-competition-content">
				<div class="competition-grid">
					<competition title="11 марта">
						<p>
							в&nbsp;Доме молодежи &laquo;Йэшлек house&raquo; состоялось награждение победителей открытого творческого
							конкурса на&nbsp;создание фирменного стиля празднования 450-летия Уфы.<br />
							Участие в&nbsp;нем приняли как отдельные авторы, так и&nbsp;команды в&nbsp;области дизайна, графики,
							художественного искусства. Организатором выступил региональный центр компетенций по&nbsp;вопросам
							городской среды Институт развития городов и&nbsp;сел Башкортостана в&nbsp;партнерстве
							с&nbsp;Администрацией Уфы и&nbsp;рабочей группой празднования 450-летия основания Уфы.
						</p>
					</competition>
					<competition class="competition-card" title="28 из 34">
						<p>
							Всего было представлено 34&nbsp;работы, 28&nbsp;из&nbsp;них прошли на&nbsp;оценку жюри. Каждая конкурсная
							работа включала в&nbsp;себя общую концепцию, фирменные цвета и&nbsp;шрифт, графические элементы, логотип
							и&nbsp;символ (маскот, персонаж).
						</p>
						<p>
							<i
								>&mdash;&nbsp;Все работы были интересными, участники подошли к&nbsp;заданию творчески,
								креативно,&nbsp;&mdash; </i
							>отметила она.<i
								>&mdash;&nbsp;Тройку финалистов жюри определяло анонимно&nbsp;&mdash; все работы были представлены под
								номерами и&nbsp;оценивались экспертами по&nbsp;системе баллов. Победителя среди них выбирали горожане
								путем интернет-голосования. Работа победителя станет основой для разработки визуального сопровождения
								празднования предстоящего юбилея города.</i
							>
						</p>
					</competition>
					<competition class="competition-card" title="Результаты">
						<template #svg>
							<svg xmlns="http://www.w3.org/2000/svg" width="82" height="101" fill="none" viewBox="0 0 82 101">
								<path
									fill="var(--coral)"
									d="M1.564 56.528c0 10.833 4.114 21.223 11.436 28.883 7.323 7.66 17.254 11.964 27.61 11.964 10.355 0 20.286-4.303 27.609-11.964 7.322-7.66 11.436-18.05 11.436-28.883v-.738a29.709 29.709 0 0 1-5.693 4.41 32.553 32.553 0 0 0 1.075-8.306 32.018 32.018 0 0 0-3.683-14.974 29.33 29.33 0 0 0-1.124-1.948 31.982 31.982 0 0 0-2.707-3.656 30.567 30.567 0 0 0-5.168-4.883 28.242 28.242 0 0 1-1.878 2.317l-.59-.317c-5.025-2.752-9.202-6.935-12.05-12.066-.173-.334-.362-.66-.526-1.012a29.343 29.343 0 0 1-1.468-3.433c-.066-.137-.115-.283-.172-.437a32.153 32.153 0 0 1-1.288-5.029 33.433 33.433 0 0 1-.451-4.394c-3.514 1.975-6.42 4.95-8.384 8.582a21.943 21.943 0 0 0-2.132 5.706c-.099.412-.18.858-.246 1.262a19.35 19.35 0 0 1-2.396-.618 20.082 20.082 0 0 1-6.373-3.544 19.072 19.072 0 0 1-2.355-2.231A22.358 22.358 0 0 0 20.3 14.59a17.72 17.72 0 0 0-.476 1.313 22.494 22.494 0 0 0-1.214 6.865v.464c0 .738.041 1.467.107 2.18a22.258 22.258 0 0 0 1.436 6.17 30.698 30.698 0 0 1-5.234-5.785 38.945 38.945 0 0 1-1.485-2.368c-.278-.472-.533-.953-.82-1.442-.205.215-.402.438-.582.661C6.709 28.8 3.567 36.676 3.13 44.96c0 .687-.058 1.373-.058 2.06a37.654 37.654 0 0 0 .624 6.865 20.424 20.424 0 0 1-1.953-1.648 42.808 42.808 0 0 0-.18 4.291Z"
								/>
								<path
									fill="#F2F2F2"
									d="M40.542 100.5a38.475 38.475 0 0 1-16.518-3.727c-5.199-2.462-9.851-6.061-13.654-10.562-3.803-4.501-6.67-9.804-8.416-15.562A45.639 45.639 0 0 1 .236 52.79c.037-.352.164-.688.368-.968.204-.281.477-.497.788-.624l.285-.086a41.538 41.538 0 0 1-.138-3.349c0-.735 0-1.462.057-2.18.478-8.78 3.757-17.123 9.295-23.656.179-.225.39-.475.618-.726.2-.214.444-.375.712-.471a1.722 1.722 0 0 1 1.62.245c.234.175.425.407.558.676.228.458.464.908.716 1.35a35.57 35.57 0 0 0 1.4 2.275c.155.225.31.441.472.657a26.36 26.36 0 0 1-.09-2.085v-.588a24.336 24.336 0 0 1 1.303-7.476c.146-.458.317-.943.504-1.419a25.027 25.027 0 0 1 1.913-3.737c.149-.246.348-.452.584-.602.236-.15.501-.24.775-.264a1.67 1.67 0 0 1 .8.12c.254.105.482.272.665.486a17.26 17.26 0 0 0 2.1 2.025 18.055 18.055 0 0 0 5.698 3.244h.106l.415.147a24.32 24.32 0 0 1 2.148-5.641c2.113-3.983 5.246-7.248 9.035-9.414A1.715 1.715 0 0 1 44.69.75c.266.161.488.392.647.67a2 2 0 0 1 .26.919c.05 1.398.189 2.791.414 4.17.277 1.616.68 3.205 1.205 4.75v.087c.017.065.039.129.065.19a.947.947 0 0 1 .065.173 27.885 27.885 0 0 0 1.368 3.227c.114.234.22.442.325.64l.187.355a29.272 29.272 0 0 0 3.37 4.915 27.65 27.65 0 0 0 7.252 6.22c.285-.354.562-.726.814-1.107.281-.386.69-.644 1.145-.72.454-.075.918.037 1.297.314 3.293 2.431 6.108 5.523 8.285 9.102.424.675.814 1.376 1.189 2.085 2.544 4.905 3.877 10.415 3.874 16.016 0 1.4-.08 2.798-.244 4.187a29.966 29.966 0 0 0 1.79-1.644c.251-.252.565-.423.904-.492a1.7 1.7 0 0 1 1.01.106c.32.138.596.371.795.671.2.3.313.655.328 1.022v.822c-.018 11.413-4.289 22.354-11.878 30.426-7.59 8.073-17.879 12.62-28.615 12.645ZM3.614 56.538v.865c.008 10.11 3.684 19.828 10.262 27.13s15.551 11.626 25.053 12.072c9.501.445 18.798-3.021 25.956-9.678 7.158-6.658 11.624-15.993 12.47-26.063a30.228 30.228 0 0 1-2.832 1.93 1.713 1.713 0 0 1-1.992-.156 1.916 1.916 0 0 1-.602-.907 2.027 2.027 0 0 1-.027-1.11c1.924-7.403 1.047-15.312-2.442-22.037a25.536 25.536 0 0 0-1.041-1.834 28.891 28.891 0 0 0-2.49-3.461 28.474 28.474 0 0 0-3.509-3.53c-.277.355-.57.692-.863 1.02a1.778 1.778 0 0 1-.996.57 1.712 1.712 0 0 1-1.12-.171l-.602-.338c-5.312-2.95-9.72-7.454-12.706-12.978l-.195-.363c-.13-.251-.26-.502-.382-.762a32.293 32.293 0 0 1-1.514-3.582c-.057-.138-.106-.285-.155-.424-.049-.138 0-.095-.04-.104a34.343 34.343 0 0 1-1.572-6.844 19.723 19.723 0 0 0-5.209 6.3 20.191 20.191 0 0 0-1.929 5.251c-.097.398-.17.77-.227 1.142-.038.256-.125.5-.254.72-.13.219-.3.407-.5.555-.2.147-.426.25-.664.301a1.694 1.694 0 0 1-.723-.001 21.88 21.88 0 0 1-2.442-.692h-.065a21.582 21.582 0 0 1-6.894-3.902c-.277-.217-.545-.45-.814-.693-.17.364-.333.736-.488 1.108-.155.372-.293.779-.423 1.185a20.866 20.866 0 0 0-1.1 6.368v.424c0 .65 0 1.324.099 2.016.175 1.934.62 3.83 1.318 5.624.154.395.18.833.072 1.244a1.919 1.919 0 0 1-.664 1.027 1.727 1.727 0 0 1-1.118.374 1.737 1.737 0 0 1-1.098-.438 32.805 32.805 0 0 1-5.502-6.178c-.39-.58-.757-1.15-1.09-1.73-4.365 5.68-6.93 12.681-7.326 20.003-.04.65-.049 1.307-.049 1.965 0 2.191.193 4.379.578 6.532.054.307.037.623-.05.921a1.94 1.94 0 0 1-.448.79 1.79 1.79 0 0 1-.744.477c-.28.092-.577.11-.866.053l-.04.009Z"
								/>
							</svg>
						</template>
						<p>
							В&nbsp;результате оценок жюри и&nbsp;интернет-голосования победителем и&nbsp;обладателем приза в&nbsp;150
							тысяч рублей стала конкурсная работа студии &laquo;Банан&raquo;, 2&nbsp;место и&nbsp;100 тысяч получила
							дизайнер Мария Чинёнова, 3&nbsp;место и&nbsp;50&nbsp;тысяч&nbsp;&mdash; дизайнер Анна Сотникова.<br />
							Комментируя участие в&nbsp;конкурсе и&nbsp;его итоги, представитель студии &laquo;Банан&raquo; Руслан
							Зиатдинов пояснил, что в&nbsp;основу концепции положена мысль о&nbsp;том, что город и&nbsp;его
							история&nbsp;&mdash; это люди, поэтому в&nbsp;оформлении показаны известные люди, прославившие Уфу
							и&nbsp;нашу республику. Актуальности ей&nbsp;придает использование QR-кодов, а&nbsp;шрифт и&nbsp;символы
							отсылают к&nbsp;древним народными рисункам и&nbsp;узорам.
						</p>
					</competition>

					<div class="presentation-wrapper">
						<presentation />
						<svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 601 600">
							<path
								stroke="var(--green)"
								stroke-linecap="round"
								stroke-linejoin="round"
								stroke-width="30.262"
								d="m410.798 45.047-89.859 206.045 206.047 89.857"
							/>
							<path
								stroke="var(--yellow)"
								stroke-linecap="round"
								stroke-linejoin="round"
								stroke-width="30.262"
								d="m120.857 158.895 206.045 89.857-89.857 206.046"
							/>
						</svg>
					</div>
				</div>
				<div class="competition-media-grid">
					<media v-for="item in mediasStore.items" :key="item.title" :media="item" />
				</div>
			</div>
		</div>
		<template #outside>
			<div class="section-competition__pattern">
				<svg
					class="up-xxl"
					xmlns="http://www.w3.org/2000/svg"
					width="2300"
					height="1440"
					fill="none"
					viewBox="0 0 2300 1440"
				>
					<path
						stroke="var(--yellow)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="44.931"
						d="m1722.93-22.073-86.38 322.38 322.38 86.384m-322.16-86.001-12.38 46.221a48.806 48.806 0 0 1-8.44 17.101 48.73 48.73 0 0 1-14.33 12.573 48.921 48.921 0 0 1-18.06 6.129 48.82 48.82 0 0 1-19.02-1.247 48.97 48.97 0 0 1-17.11-8.434 48.887 48.887 0 0 1-18.7-32.391 48.844 48.844 0 0 1 1.25-19.027l-.2.757a48.796 48.796 0 0 1 8.43-17.102 48.906 48.906 0 0 1 32.39-18.701 48.883 48.883 0 0 1 19.03 1.247l47.14 12.874Z"
					/>
					<path
						stroke="var(--lilac)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="44.931"
						d="m1731.14-26.813 322.38 86.381-86.38 322.383"
					/>
					<path
						stroke="var(--lilac)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="44.931"
						d="m2048.99 61.673 12.39-46.222a48.96 48.96 0 0 1 8.43-17.101 48.898 48.898 0 0 1 32.4-18.702 48.84 48.84 0 0 1 19.02 1.247 48.841 48.841 0 0 1 17.1 8.434 48.789 48.789 0 0 1 12.58 14.336 49.073 49.073 0 0 1 6.13 18.056c.83 6.362.41 12.828-1.25 19.027l.2-.757a48.96 48.96 0 0 1-8.43 17.101 48.898 48.898 0 0 1-32.39 18.701 48.87 48.87 0 0 1-19.03-1.247l-47.15-12.873Z"
					/>
					<path
						stroke="var(--green)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="53.632"
						d="m2035.1 686.085-159.25 365.165 365.17 159.25"
					/>
					<path
						stroke="var(--yellow)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="53.632"
						d="m1521.25 887.854 365.17 159.246-159.25 365.17"
					/>
				</svg>
				<svg
					class="up-xl"
					xmlns="http://www.w3.org/2000/svg"
					width="1876"
					height="1600"
					fill="none"
					viewBox="0 0 1876 1600"
				>
					<path
						stroke="var(--green)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="53.632"
						d="M1506.2 667.106 1403.08 1059.6l384.81 105.17"
					/>
					<path
						stroke="var(--yellow)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="53.632"
						d="m1028.11 948.648 384.8 105.172-103.1 392.5"
					/>
					<path
						stroke="var(--yellow)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="30.386"
						d="m1307.89 40.775-58.42 222.376 218.02 59.587m-217.86-59.324-8.38 31.884a33.953 33.953 0 0 1-5.7 11.796 33.355 33.355 0 0 1-9.7 8.672 32.63 32.63 0 0 1-12.21 4.228c-4.3.578-8.67.286-12.87-.86a32.78 32.78 0 0 1-11.56-5.817 33.565 33.565 0 0 1-8.5-9.889 34.243 34.243 0 0 1-4.15-12.455c-.57-4.389-.28-8.849.84-13.125l-.13.523a33.958 33.958 0 0 1 5.7-11.797 33.228 33.228 0 0 1 9.7-8.672 32.51 32.51 0 0 1 12.21-4.228c4.3-.578 8.67-.286 12.86.86l31.89 8.88Z"
					/>
					<path
						stroke="var(--lilac)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="30.386"
						d="m1313.45 37.505 218.01 59.585-58.41 222.378"
					/>
					<path
						stroke="var(--lilac)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="30.386"
						d="m1528.4 98.542 8.38-31.884a33.955 33.955 0 0 1 5.7-11.796 33.362 33.362 0 0 1 9.7-8.672 32.637 32.637 0 0 1 12.21-4.228 32.44 32.44 0 0 1 12.87.86 32.762 32.762 0 0 1 11.56 5.817 33.408 33.408 0 0 1 8.5 9.89 34.24 34.24 0 0 1 4.15 12.454c.57 4.39.28 8.849-.84 13.125l.13-.522a33.955 33.955 0 0 1-5.7 11.796 33.228 33.228 0 0 1-9.7 8.672 32.51 32.51 0 0 1-12.21 4.228c-4.3.578-8.67.286-12.86-.86l-31.89-8.88Z"
					/>
				</svg>

				<svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 508 334">
					<path
						stroke="var(--yellow)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="20.053"
						d="M285.54 92.839 246.987 236.72l143.882 38.554m-143.783-38.383-5.528 20.63a21.814 21.814 0 0 1-10.162 13.243 21.815 21.815 0 0 1-16.55 2.179 21.804 21.804 0 0 1-15.979-18.221 21.816 21.816 0 0 1 .556-8.492l-.09.338a21.8 21.8 0 0 1 10.162-13.243 21.797 21.797 0 0 1 16.55-2.179l21.041 5.745Z"
					/>
					<path
						stroke="var(--lilac)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="20.053"
						d="m289.205 90.723 143.882 38.553-38.552 143.883"
					/>
					<path
						stroke="var(--lilac)"
						stroke-linecap="round"
						stroke-linejoin="round"
						stroke-width="20.053"
						d="m431.067 130.215 5.528-20.629a21.805 21.805 0 0 1 26.712-15.422 21.805 21.805 0 0 1 15.98 18.22c.374 2.84.184 5.726-.557 8.492l.091-.338a21.815 21.815 0 0 1-26.713 15.423l-21.041-5.746Z"
					/>
				</svg>
			</div>

			<div class="section-competition__qr">
				<nuxt-picture loading="lazy" class="up-xxl" :width="1920" :height="500" src="/images/qr-up-xxl.png" />
				<nuxt-picture loading="lazy" class="up-xl" :width="1200" :height="382" src="/images/qr-up-xl.png" />
				<nuxt-picture loading="lazy" :width="460" :height="433" src="/images/qr.png" />
			</div>
			<div>
				<svg class="section-competition__logo" viewBox="0 0 711 287" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path
						fill-rule="evenodd"
						clip-rule="evenodd"
						d="M532.059 210.632C532.004 210.579 531.95 210.525 531.896 210.471L457.897 136.335C426.959 105.34 426.959 54.2407 457.897 23.246C488.834 -7.74867 539.839 -7.74867 570.777 23.246L588.627 41.1287C588.671 41.1712 588.714 41.2141 588.757 41.2574L687.423 140.105C702.474 155.184 710.835 175.288 710.835 196.65C710.835 218.011 702.474 238.115 687.423 253.194C671.954 268.272 652.305 276.649 630.983 276.649C609.661 276.649 589.594 268.272 574.543 253.194L532.059 210.632ZM551.599 195.862C551.054 194.776 550.34 193.765 549.455 192.879L475.456 118.743C453.716 97.3819 453.716 62.1988 475.456 40.4188C496.777 18.6387 531.896 18.6387 553.636 40.4188L590.426 77.2773C590.47 77.3205 590.513 77.3633 590.557 77.4057L670.282 157.278C680.734 167.749 686.587 181.571 686.587 196.65C686.587 211.728 680.734 225.55 670.282 236.021C659.83 246.492 646.034 252.356 630.983 252.356C615.932 252.356 602.136 246.492 591.684 236.021L551.599 195.862ZM12.2286 188.69C9.30209 188.69 5.95758 187.434 3.44913 184.921C-1.14971 180.313 -1.14971 172.355 3.44913 167.748L164.826 6.07316C169.425 1.46585 177.369 1.46585 181.967 6.07316C186.566 10.6805 186.566 18.6385 181.967 23.2458L41.0751 164.398H140.995V150.576C140.995 129.214 158.137 112.042 179.458 112.042C200.362 112.042 217.503 129.214 217.921 150.157V150.576C217.921 171.937 200.78 188.691 179.458 188.691H166.08V274.555C165.662 281.256 160.227 286.701 153.538 286.701C146.849 286.701 141.414 281.256 141.414 274.555V188.691H12.6468C12.5708 188.691 12.495 188.69 12.4193 188.689C12.3559 188.69 12.2923 188.69 12.2286 188.69ZM166.08 164.397H179.876C187.402 164.397 193.673 158.115 193.673 150.576C193.673 143.036 187.402 136.754 179.876 136.754C172.351 136.754 166.08 143.036 166.08 150.576V164.397ZM269.345 152.25C262.656 152.25 257.221 146.805 257.221 140.104V6.49133H411.491C418.18 6.49133 423.615 11.9364 423.615 18.6379C423.615 25.3395 418.18 30.7845 411.491 30.7845H281.469V127.957H364.667C404.802 127.957 437.412 160.627 437.412 200.836C437.412 241.046 404.802 273.716 364.667 273.716H224.611C217.922 273.716 212.487 268.271 212.487 261.569C212.487 254.868 217.922 249.423 224.611 249.423H364.667C391.423 249.423 413.164 227.643 413.164 200.836C413.164 174.03 391.423 152.25 364.667 152.25H270.181C270.042 152.25 269.902 152.248 269.763 152.243C269.625 152.248 269.485 152.25 269.345 152.25Z"
						fill="white"
					/>
				</svg>
			</div>
		</template>
	</the-section>
</template>

<style scoped lang="scss">
@use 'sass:math';
@use 'assets/style/utility';
@use 'assets/style/breakpoints';

.section-competition {
	position: relative;
	overflow: hidden;
	padding-bottom: #{utility.rem(262)};
	background-color: var(--blue);

	:deep(.section-title) {
		color: var(--write);

		@include breakpoints.media-down('xl') {
			position: relative;
			z-index: 1;
			max-width: #{utility.rem(268)};
			margin-top: 0;
			padding-top: #{utility.rem(16)};
		}
	}

	& &__pattern,
	& &__qr,
	& &__logo {
		position: absolute;
		top: 0;
		left: 50%;
		display: block;
		pointer-events: none;
		transform: translateX(-50%);

		> svg,
		:deep(img) {
			display: block;
		}

		svg:not(:is(.up-xxl, .up-xl)) {
			width: #{utility.rem(508)};
			height: #{utility.rem(334)};
		}

		:deep(picture:not(:is(.up-xxl, .up-xl)) img) {
			position: relative;
			top: #{utility.rem(-99)};
			width: #{utility.rem(460)};
			height: #{utility.rem(433)};
		}

		> svg:is(.up-xxl, .up-xl),
		> :deep(picture:is(.up-xxl, .up-xl)) {
			display: none;
		}

		@include breakpoints.media-down('xl') {
			bottom: #{utility.rem(-4)};
		}

		@include breakpoints.media-up('xl') {
			top: 0;

			svg:is(.up-xl),
			:deep(picture:is(.up-xl)) {
				display: block;
			}

			svg:not(.up-xl),
			:deep(picture:not(.up-xl)) {
				display: none;
			}
		}

		@include breakpoints.media-up('xxl') {
			top: 0;

			svg:is(.up-xxl),
			:deep(picture:is(.up-xxl)) {
				display: block;
			}

			svg:not(.up-xxl),
			:deep(picture:not(.up-xxl)) {
				display: none;
			}
		}
	}

	& &__qr {
		z-index: 1;
	}

	& &__logo {
		top: unset;
		bottom: #{utility.rem(-50)};
		width: #{utility.rem(710.84)};
		height: #{utility.rem(286.7)};
	}

	@include breakpoints.media-down('xl') {
		padding-bottom: #{utility.rem(280)};

		& &__logo {
			bottom: #{utility.rem(160)};
			width: #{utility.rem(288)};
			height: #{utility.rem(111.03)};
		}
	}
}

.competition-grid {
	display: grid;
	grid-template-columns: repeat(2, 1fr);
	gap: #{utility.rem(64)} #{utility.rem(175)};
	align-items: start;

	@include breakpoints.media-down('xxl') {
		gap: #{utility.rem(64)} #{utility.rem(90)};
	}

	@include breakpoints.media-down('xl') {
		grid-template-columns: 1fr;
		gap: #{utility.rem(32)};
	}
}

.presentation-wrapper {
	position: relative;

	svg {
		position: absolute;
		top: 50%;
		left: 50%;
		width: #{utility.rem(601)};
		height: #{utility.rem(600)};
		transform: translate3d(-50%, -50%, 0);
	}

	:deep(.presentation) {
		position: relative;
		z-index: 1;
	}

	@include breakpoints.media-up('xl') {
		svg {
			display: none;
		}
	}
}

.section-competition-content {
	display: grid;
	gap: #{utility.rem(64)};

	.presentation,
	.presentation-wrapper {
		z-index: 1;
		height: 100%;
	}

	@include breakpoints.media-down('xl') {
		gap: #{utility.rem(32)};
	}
}

.competition-media-grid {
	z-index: 1;
	display: grid;

	@include breakpoints.media-up('xl') {
		grid-template-columns: #{utility.column(math.div(8, 12), utility.rem(16))} #{utility.column(
				math.div(4, 12),
				utility.rem(16)
			)};

		// grid-template-rows: #{utility.rem(378)}  #{utility.rem(310)} auto;

		gap: #{utility.rem(16)};

		> div {
			&:first-child {
				grid-row: 1 / 3;

				// height: #{utility.rem(432)};
			}

			&:nth-child(2) {
				// height: #{utility.rem(378)};
			}

			&:nth-child(3) {
				// height: #{utility.rem(162)};
			}

			&:nth-child(4) {
				grid-column: 1 / 3;
			}
		}
	}

	@include breakpoints.media-down('xl') {
		grid-template-columns: 1fr;
		gap: #{utility.rem(16)};
	}
}
</style>
